/* drivers/input/touchscreen/qt602240.c
 *
 * Quantum TSP driver.
 *
 * Copyright (C) 2009 Samsung Electronics Co. Ltd.
 *
 */

#include <linux/module.h>
#include <linux/input.h>
#include <linux/interrupt.h>
#include <linux/platform_device.h>
#include <linux/i2c.h>
#include <linux/delay.h>
#include <linux/interrupt.h>
#include <linux/irq.h>
#include <linux/earlysuspend.h>
#include <linux/timer.h>    // add timer
#include <asm/io.h>
#include <mach/regs-gpio.h>
#include <plat/gpio-cfg.h>
#include <plat/irqs.h>
#include <mach/hardware.h>
#include <mach/gpio.h>
#include <linux/jiffies.h>
#include <plat/iic.h> //#include "cytma340.h"
#include <linux/workqueue.h>
#include <plat/regs-watchdog.h>

/*
 *	Operation Features
 */

#define CYTSP_TIMER_ENABLE
// #define	CYTSP_HWRESET_LONGKEY // Rossi Workaround Code
//#define CYTSP_WDOG_ENABLE
#define CYTSP_FWUPG_ENABLE

#define TOUCH_DVFS_CONTROL 1

#ifdef CYTSP_FWUPG_ENABLE
#ifdef CONFIG_VENTURI_USA
#include "cytma340_fw_usa.h"
#else
#include "cytma340_fw.h"
#endif
#endif

#ifdef CONFIG_CPU_FREQ
#include <mach/cpu-freq-v210.h>
#endif

#include <mach/gpio.h>


static	void	__iomem		*gpio_pend_mask_mem;

#define INT_PEND_BASE	0xE0200A44
#define IRQ_TOUCH_INT (IRQ_EINT_GROUP18_BASE+5) /* J0_5 */

enum driver_setup_t {DRIVER_SETUP_OK, DRIVER_SETUP_INCOMPLETE};



struct i2c_driver 			cytouch_i2c_driver;
struct workqueue_struct 	*cytouch_wq = NULL;
static struct input_dev*	gp_cytouch_input;
static struct i2c_client*	gp_cytouch_client;

static DEFINE_MUTEX(cytouch_i2c_lock);

#ifdef CYTSP_FWUPG_ENABLE
static int cytouch_upgrade_fw(void);
static int cytouch_upgrade_fw_force(void);
int tma340_frimware_update(void);
#define CYPRESS_DISABLE_WATCHDOG_TIMER_RESET()   __raw_writel(0, S3C2410_WTCON); /* disable watchdog, to download touch firmware */  
/* enable watchdog, after  downloading  touch firmware  */
#define CYPRESS_ROLLBACK_WATCHDOG_TIMER_RESET()    unsigned int val;              \
           static unsigned watchdog_reset = (30 * 2048);      \
           val = S3C2410_WTCON_DIV128;        \
             val |= S3C2410_WTCON_PRESCALE(255);                  \
               writel(val, S3C2410_WTCON);                          \
        writel(watchdog_reset, S3C2410_WTCNT);               \
               writel(watchdog_reset, S3C2410_WTDAT);              \
               val |= S3C2410_WTCON_RSTEN | S3C2410_WTCON_ENABLE;   \
        writel(val,S3C2410_WTCON);


#endif


unsigned int touch_state_val=0;
EXPORT_SYMBOL(touch_state_val);

int set_tsp_for_ta_detect(int state)
{
	return 1;
}
EXPORT_SYMBOL(set_tsp_for_ta_detect);


void TSP_forced_release(void)
{
}
EXPORT_SYMBOL(TSP_forced_release);

void TSP_forced_release_forOKkey(void)
{
}

EXPORT_SYMBOL(TSP_forced_release_forOKkey);


static int cytouch_i2c_read(u8 reg, u8* data, int len);


/********************** ++Cypress ***********************************/

#define CYTOUCH_REG_HST_MODE 		0x00
#define CYTOUCH_REG_TT_MODE 		0x01
#define CYTOUCH_REG_TT_STAT 		0x02	// 0
#define CYTOUCH_REG_TOUCH1_XH 		0x03	// 1
#define CYTOUCH_REG_TOUCH1_XL 		0x04	// 2
#define CYTOUCH_REG_TOUCH1_YH 		0x05	// 3
#define CYTOUCH_REG_TOUCH1_YL 		0x06	// 4
#define CYTOUCH_REG_TOUCH1_Z 		0x07	// 5
#define CYTOUCH_REG_TOUCH12_ID 		0x08	// 6
#define CYTOUCH_REG_TOUCH2_XH 		0x09	// 7
#define CYTOUCH_REG_TOUCH2_XL 		0x0A	// 8
#define CYTOUCH_REG_TOUCH2_YH 		0x0B	// 9
#define CYTOUCH_REG_TOUCH2_YL 		0x0C	// 10
#define CYTOUCH_REG_TOUCH2_Z 		0x0D	// 11
#define CYTOUCH_REG_GEST_CNT 		0x0E
#define CYTOUCH_REG_GEST_ID 		0x0F
#define CYTOUCH_REG_TOUCH3_XH 		0x10
#define CYTOUCH_REG_TOUCH3_XL 		0x11
#define CYTOUCH_REG_TOUCH3_YH 		0x12
#define CYTOUCH_REG_TOUCH3_YL 		0x13
#define CYTOUCH_REG_TOUCH3_Z 		0x14
#define CYTOUCH_REG_TOUCH34_ID 		0x15
#define CYTOUCH_REG_TOUCH4_XH 		0x16
#define CYTOUCH_REG_TOUCH4_XL 		0x17
#define CYTOUCH_REG_TOUCH4_YH 		0x18
#define CYTOUCH_REG_TOUCH4_YL 		0x19
#define CYTOUCH_REG_TOUCH4_Z 		0x1A
#define CYTOUCH_REG_VENDOR_ID 		0x1B
#define CYTOUCH_REG_MODULE_ID 		0x1C
#define CYTOUCH_REG_FW_VER 			0x1D
#define CYTOUCH_REG_GEST_SET 		0x1E
#define CYTOUCH_REG_WDOG 			0x1F
#define CYTOUCH_REG_CALIBRATE		0x00
#define CYTOUCH_REG_READ_START		CYTOUCH_REG_TT_STAT
#define CYTOUCH_REG_READ_SIZE		(CYTOUCH_REG_TOUCH2_Z-CYTOUCH_REG_TT_STAT+1)
#define CYTOUCH_REG_READ_POS(x)		(x-CYTOUCH_REG_READ_START)
#define CYTOUCH_MAX_ID			(15)


typedef enum
{
	CYTOUCH_PWROFF = 0,
	CYTOUCH_PWRON = 1,
}CYTOUCH_PWRSTAT;

static int cytouch_hw_set_pwr(CYTOUCH_PWRSTAT onoff);

typedef struct
{
	int x;
	int y;
	int z;
	int stat;
	int id;
}CYTOUCH_POINT;

enum
{
	CYTOUCH_ID_STAT_RELEASED = 0,
	CYTOUCH_ID_STAT_PRESSED = 1,
	CYTOUCH_ID_STAT_MOVED = 2,
};

enum
{
	CYTOUCH_ID_STAT_DIRTY = 0,
	CYTOUCH_ID_STAT_NEW = 1,
};

typedef struct
{
	int status;
	int dirty;
	int x,y,z;
	int b_report;
}CYTOUCH_ID_STAT;

CYTOUCH_ID_STAT g_cytouch_id_stat[CYTOUCH_MAX_ID+1]={{0,0,0,0,0,0},};// {0,};
bool g_cytouch_log[CYTOUCH_MAX_ID+1] = {0,};

typedef struct
{
	u8 tt_stat;		// 0
	u8 touch1_xh;	// 1
	u8 touch1_xl;	// 2
	u8 touch1_yh;	// 3
	u8 touch1_yl;	// 4
	u8 touch1_z;	// 5
	u8 touch12_id;	// 6
	u8 touch2_xh;	// 7
	u8 touch2_xl;	// 8
	u8 touch2_yh;	// 9
	u8 touch2_yl;	//10
	u8 touch2_z;	//11
	u8 gest_cnt;	//12
	u8 gest_id;		//13
	u8 touch3_xh;	//14
	u8 touch3_xl;	//15
	u8 touch3_yh;	//16
	u8 touch3_yl;	//17
	u8 touch3_z;	//18
	u8 touch34_id;	//19
	u8 touch4_xh;	//20
	u8 touch4_xl;	//21
	u8 touch4_yh;	//22
	u8 touch4_yl;	//23
	u8 touch4_z;	//24    size = 25
#ifdef CONFIG_VENTURI_USA
	u8 vendor_id;	//25    size = 26
#endif
}__attribute__((packed))CYTOUCH_RAW_DATA;

/********************** --Cypress ***********************************/

#define TSP_PRESSED 				1
#define TSP_RELEASE 				0
#define TSP_INITIAL 				-1
#define TSP_FORCED_RELEASE			-2
#ifdef CONFIG_VENTURI_USA
#define TSP_MENUKEY_PRESS			0x01
#define TSP_HOMEKEY_PRESS			0x02
#define TSP_BACKKEY_PRESS			0x04
#else
#define TSP_MENUKEY_PRESS			0x40
#define TSP_BACKKEY_PRESS			0x80
#endif
#define TOUCHKEY_KEYCODE_MENU		158
#define TOUCHKEY_KEYCODE_BACK		28

static u8		prev_menu =	0;
static u8		prev_back =	0;
static u8		prev_num_of_touch = 0;

#ifdef CYTSP_TIMER_ENABLE
static struct timer_list g_cytouch_backkey_timer;
static struct timer_list g_cytouch_menukey_timer;
static struct timer_list g_cytouch_touch_timer;
#endif

static int prev_wdog_val = -1;

static u64 g_backkey_start_time = 0;
static u64 g_menukey_start_time = 0;

